Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/svd/PIC32CX1025MTG128.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DWDT</name>
         <version>04686C</version>
         <description>Dual Watchdog Timer</description>
         <baseAddress>0x40052000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1240</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DWDT0</name>
            <value>4</value>
         </interrupt>
         <interrupt>
            <name>DWDT1</name>
            <value>5</value>
         </interrupt>
         <registers>
            <register>
               <name>WDT1_CR</name>
               <description>Watchdog 1 Control Register</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>WDRSTT</name>
                     <description>Watchdog Restart</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKMR</name>
                     <description>Lock Mode Register Write Access</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_MR</name>
               <description>Watchdog 1 Mode Register</description>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PERIODRST</name>
                     <description>Watchdog Overflow Period Reset Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHRST</name>
                     <description>Repeat Threshold Reset Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDNRSTDIS</name>
                     <description>Watchdog Reset NRST Pin Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDDIS</name>
                     <description>Watchdog Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDIDLEHLT</name>
                     <description>Watchdog Idle Halt</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDDBG0HLT</name>
                     <description>Watchdog Core 0 Debug Halt</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDDBG1HLT</name>
                     <description>Watchdog Core 1 Debug Halt</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_VR</name>
               <description>Watchdog 1 Value Register</description>
               <addressOffset>0x0008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNTER</name>
                     <description>Watchdog Down Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_WL</name>
               <description>Watchdog 1 Window Level Register</description>
               <addressOffset>0x000C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PERIOD</name>
                     <description>Watchdog Period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>RPTH</name>
                     <description>Repeat Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_IL</name>
               <description>Watchdog 1 Interrupt Level Register</description>
               <addressOffset>0x0010</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LVLTH</name>
                     <description>Level Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>PRESC</name>
                     <description>Prescaler Ratio</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PRESCSelect</name>
                        <enumeratedValue>
                           <name>RATIO128</name>
                           <description>The watchdog counter decreased when the prescaler reaches 128.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO64</name>
                           <description>The watchdog counter decreased when the prescaler reaches 64.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO32</name>
                           <description>The watchdog counter decreased when the prescaler reaches 32.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO16</name>
                           <description>The watchdog counter decreased when the prescaler reaches 16.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO8</name>
                           <description>The watchdog counter decreased when the prescaler reaches 8.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO4</name>
                           <description>The watchdog counter decreased when the prescaler reaches 4.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO2</name>
                           <description>The watchdog counter decreased when the prescaler reaches 2.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO1</name>
                           <description>The watchdog counter decreased when the prescaler reaches 1.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_IER</name>
               <description>Watchdog 1 Interrupt Enable Register</description>
               <addressOffset>0x0014</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PERINT</name>
                     <description>Overflow Period Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHINT</name>
                     <description>Reload Repeat Period Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLINT</name>
                     <description>Interrupt Level Threshold Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLDERR</name>
                     <description>Reload Command Error Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_IDR</name>
               <description>Watchdog 1 Interrupt Disable Register</description>
               <addressOffset>0x0018</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PERINT</name>
                     <description>Overflow Period Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHINT</name>
                     <description>Reload Repeat Period Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLINT</name>
                     <description>Interrupt Level Threshold Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLDERR</name>
                     <description>Reload Command Error Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_ISR</name>
               <description>Watchdog 1 Interrupt Status Register</description>
               <addressOffset>0x001C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PERINT</name>
                     <description>Overflow Period Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHINT</name>
                     <description>Reload Repeat Period Status (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLINT</name>
                     <description>Interrupt Level Threshold Status (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLDERR</name>
                     <description>Reload Command Error Status (cleared on read)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_IMR</name>
               <description>Watchdog 1 Interrupt Mask Register</description>
               <addressOffset>0x0020</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PERINT</name>
                     <description>Overflow Period Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHINT</name>
                     <description>Reload Repeat Period Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLINT</name>
                     <description>Interrupt Level Threshold Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLDERR</name>
                     <description>Reload Command Error Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT0_CR</name>
               <description>Watchdog 0 Control Register</description>
               <addressOffset>0x1210</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>WDRSTT</name>
                     <description>Watchdog Restart</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKMR</name>
                     <description>Lock Mode Register Write Access</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT0_MR</name>
               <description>Watchdog 0 Mode Register</description>
               <addressOffset>0x1214</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PERIODRST</name>
                     <description>Period Reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHRST</name>
                     <description>Repeat Threshold Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDNRSTDIS</name>
                     <description>Watchdog NRST Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDDIS</name>
                     <description>Watchdog Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDIDLEHLT</name>
                     <description>Watchdog Idle Halt</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDDBG0HLT</name>
                     <description>Watchdog Core 0 Debug Halt</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDDBG1HLT</name>
                     <description>Watchdog Core 1 Debug Halt</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT0_VR</name>
               <description>Watchdog 0 Value Register</description>
               <addressOffset>0x1218</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNTER</name>
                     <description>Watchdog Down Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT0_WL</name>
               <description>Watchdog 0 Window Level</description>
               <addressOffset>0x121C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PERIOD</name>
                     <description>Watchdog Period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>RPTH</name>
                     <description>Repeat Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT0_IL</name>
               <description>Watchdog 0 Interrupt Level</description>
               <addressOffset>0x1220</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LVLTH</name>
                     <description>Level Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>PRESC</name>
                     <description>Prescaler Ratio</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PRESCSelect</name>
                        <enumeratedValue>
                           <name>RATIO128</name>
                           <description>The watchdog counter decreased when the prescaler reaches 128.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO64</name>
                           <description>The watchdog counter decreased when the prescaler reaches 64.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO32</name>
                           <description>The watchdog counter decreased when the prescaler reaches 32.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO16</name>
                           <description>The watchdog counter decreased when the prescaler reaches 16.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO8</name>
                           <description>The watchdog counter decreased when the prescaler reaches 8.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO4</name>
                           <description>The watchdog counter decreased when the prescaler reaches 4.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO2</name>
                           <description>The watchdog counter decreased when the prescaler reaches 2.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RATIO1</name>
                           <description>The watchdog counter decreased when the prescaler reaches 1.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
