Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/svd/PIC32CX1025MTG128.svd
               <register>
                  <name>P_IOSSR</name>
                  <description>PIO Privilege I/O Security Status Register (p_iogroup = 0)</description>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>P0</name>
                        <description>I/O Security Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P0Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P1</name>
                        <description>I/O Security Status</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P1Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P2</name>
                        <description>I/O Security Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P2Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P3</name>
                        <description>I/O Security Status</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P3Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P4</name>
                        <description>I/O Security Status</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P4Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P5</name>
                        <description>I/O Security Status</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P5Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P6</name>
                        <description>I/O Security Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P6Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P7</name>
                        <description>I/O Security Status</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P7Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P8</name>
                        <description>I/O Security Status</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P8Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P9</name>
                        <description>I/O Security Status</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P9Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P10</name>
                        <description>I/O Security Status</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P10Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P11</name>
                        <description>I/O Security Status</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P11Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P12</name>
                        <description>I/O Security Status</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P12Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P13</name>
                        <description>I/O Security Status</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P13Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P14</name>
                        <description>I/O Security Status</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P14Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P15</name>
                        <description>I/O Security Status</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P15Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P16</name>
                        <description>I/O Security Status</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P16Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P17</name>
                        <description>I/O Security Status</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P17Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P18</name>
                        <description>I/O Security Status</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P18Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P19</name>
                        <description>I/O Security Status</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P19Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P20</name>
                        <description>I/O Security Status</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P20Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P21</name>
                        <description>I/O Security Status</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P21Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P22</name>
                        <description>I/O Security Status</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P22Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
